[
  {
    "path": "posts/2021-09-29-nomorehugo/",
    "title": "Bye Hugo Academic, hello Distill for Rmarkdown",
    "description": "Why I gave up on Hugo Academic",
    "author": [
      {
        "name": "Sam Parsons",
        "url": {}
      }
    ],
    "date": "2021-09-29",
    "categories": [],
    "contents": "\r\nI grew to dislike Hugo Academic for building my website. To start this website, I thought I’d share some reflections on the transition to Distill.\r\nWhy does Hugo hate me?\r\nI loved it at first. Relatively easy to set up, nice formatting, works on Rmarkdown. Lots of positives.\r\nSome months passed, and I needed to update papers. Nothing too problematic, but; copying a folder, entering all of the pieces of information, and finally completing new entries always took longer than I would like. Compared to my CV in overleaf, I can add new presentations and papers in 30 seconds, easy.\r\nAdded to this, every time there was a non-trivial update to any of R, blogdown, Hugo, something with netlify, or some combination of the way these things interact tended to break everything. Not to mention the transition to wowchemy. Every time this happened, the “easiest” thing to do was to rebuild the entire site.\r\nRebuilding the site was a) not fun, b) time consuming, and c) misses my main goal of having an easily update-able website. I want to make changes, build the site, and then push to github. I want to not enter rage every time.\r\nI almost remade it again recently. I’m glad I searched for alternatives and, luckily, spotted a few nice website/blogs. They used distill\r\nDistill is less complicated\r\nOne of the first things I read was that there were fewer dependencies on other things, including, including themes, hugo, and netlify.\r\nI still slightly prefer the Hugo Academic theme, but a simpler theme for less hassle is more than worth it. Personally, I’m liking that I can link my CV and not feel compelled to add every poster and presentation I have given to the website itself (not that you cant, but because it’s not there by default you dont feel bad about not doing so)\r\nA few tips I came across or learned:\r\nadd the following to your theme.css file to use academic icons: @import url('https://cdn.rawgit.com/jpswalsh/academicons/master/css/academicons.min.css'); You can then call the icons with something like the following (remember to replace the fab and fa with ai): <i class=\"ai ai-osf\"><\/i>\r\nyou can add a few themes with postcards, I kind of like not having too many options. You can do way more with css and html, but I want simplicity and efficiency in my life at the moment.\r\nAdding altmertic badges is pretty easy, you can just add something like the following, copied from the altmetric website\r\n\r\n\r\n\r\nBut, you’ll likely also need to add the following so that it works (from here)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-29T17:49:18+01:00",
    "input_file": {}
  }
]
